# puts 'Привет, как Вас зовут?'
# name = gets.chomp
# name2 = gets.chomp
# name3 = gets.chomp
# puts 'Ваше Ф.И.О: ' + name + name2 + name3 + '?  Спасибо за информацию!'
# puts 'Рад познакомиться с Вами, ' + name + name2 + name3 + '.  :)'

# puts 'Приветик, ваша фамилия?'
# name = gets.chomp
# puts 'Вас зовут ' + name + '?  Отлично!'
# puts 'Ваше имя?'
# name2 = gets.chomp
# puts 'А по батюшке?'
# name3 = gets.chomp
# puts 'Рад познакомиться с Вами, ' + name + ' ' + name2 + ' ' + name3 + '.  :)'

# Напишите программу, которая спрашивает у человека его любимое число. 
# Пусть ваша программа прибавит единицу к этому числу, 
# а затем предложит результат в качестве большего и лучшего любимого числа. (Однако будьте при этом тактичными.)

# puts 'Привет, а какое твое любимое число?'
# number = gets.chomp
# number2 = number.to_i + 1
# puts 'Мне кажется тебе больше подойдет: ' + number2.to_s + '. ^_^'  

# puts 'Привет, а какое твое любимое число?'
# number = gets.chomp.to_i + 1
# puts 'Мне кажется тебе больше подойдет: ' + number.to_s + '. ^_^'  
p a = 852341687 / 365 / 24 / 60 / 60